/*N人围成一圈，顺序排号。从第一个人开始报数（从1到3报数），凡报到3的人退出圈子，问最后留下的是原来第几号的人。*/

#include <stdio.h>

void main() {
	int num[50] = { -1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,
		-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,
		-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1 }, n, i = 1, j = 1, t;   /* n个数，i报数，j位置，t剩余 */
	
	scanf("%d", &n);
	t = n;

	while (t>1) {
		/* 找出最后一个 */
		if ((i % 3 != 0) && (num[j%n]) != 0) {
			/* 没报到3并且记录不为0的 就记录 */
			num[j%n] = i % 3;
			j++;
			i++;
		}
		else if (num[j%n] == 0)
			/* 已经退出的位置不要 */
			j++;
		else {
			/* 报到3就记录为0，人数减一 */
			num[j%n] = 0;
			j++;
			i++;
			t--;
		}
	}
	for (i = 0; i<n; i++)
		/* 输出记录不为零的就是最后留下的 如果位置是0就是第n个 */
		if (num[i] != 0) {
			if (i == 0)
				printf("%d\n", n);
			else
				printf("%d\n", i);
		}
}
